In [5]:

import numpy as np
import pandas as pd

people = {
    "first": ['Victor', 'Cynthia', 'Eugene','Chris', np.nan, None, 'NA'],
    "second": ['Kituku', 'Kituku','Kituku', 'Schafer', np.nan, np.nan, 'Missing'],
    "email": ['vkituku@gmail.com', 'Ckituku@gmail.com', 'Ekituku@gmail.com', None, np.nan, 'anonymous@email.com', 'NA'],
    "age": [33, 26,18,50, None, None, 'Missing']
}
df = pd.DataFrame(people)
type(df['email'])
df

# type(df)

     first   second                email      age
0   Victor   Kituku    vkituku@gmail.com       33
1  Cynthia   Kituku    Ckituku@gmail.com       26
2   Eugene   Kituku    Ekituku@gmail.com       18
3    Chris  Schafer                 None       50
4      NaN      NaN                  NaN     None
5     None      NaN  anonymous@email.com     None
6       NA  Missing                   NA  Missing

In [6]:
#Access select columns
df

     first   second                email      age
0   Victor   Kituku    vkituku@gmail.com       33
1  Cynthia   Kituku    Ckituku@gmail.com       26
2   Eugene   Kituku    Ekituku@gmail.com       18
3    Chris  Schafer                 None       50
4      NaN      NaN                  NaN     None
5     None      NaN  anonymous@email.com     None
6       NA  Missing                   NA  Missing

In [7]:
#loc and iloc for getting rows in pandas
#iloc uses integer/indexes

df.iloc[[0,1], [1,2]]

   second              email
0  Kituku  vkituku@gmail.com
1  Kituku  Ckituku@gmail.com

In [8]:
#loc uses labels
df.loc[[0,1],['email','first']]

               email    first
0  vkituku@gmail.com   Victor
1  Ckituku@gmail.com  Cynthia

In [9]:
# df.reset_index(inplace = True)
df.loc[[0,1],['first']]

     first
0   Victor
1  Cynthia

In [10]:
df

     first   second                email      age
0   Victor   Kituku    vkituku@gmail.com       33
1  Cynthia   Kituku    Ckituku@gmail.com       26
2   Eugene   Kituku    Ekituku@gmail.com       18
3    Chris  Schafer                 None       50
4      NaN      NaN                  NaN     None
5     None      NaN  anonymous@email.com     None
6       NA  Missing                   NA  Missing

In [15]:
df.dropna(axis='columns', how = 'all')

     first   second                email      age
0   Victor   Kituku    vkituku@gmail.com       33
1  Cynthia   Kituku    Ckituku@gmail.com       26
2   Eugene   Kituku    Ekituku@gmail.com       18
3    Chris  Schafer                 None       50
4      NaN      NaN                  NaN     None
5     None      NaN  anonymous@email.com     None
6       NA  Missing                   NA  Missing

In [16]:
df.dropna(axis='index', how = 'all')

     first   second                email      age
0   Victor   Kituku    vkituku@gmail.com       33
1  Cynthia   Kituku    Ckituku@gmail.com       26
2   Eugene   Kituku    Ekituku@gmail.com       18
3    Chris  Schafer                 None       50
5     None      NaN  anonymous@email.com     None
6       NA  Missing                   NA  Missing

In [22]:
df.dropna(axis='index', how='all', subset=['email','second'])

     first   second                email      age
0   Victor   Kituku    vkituku@gmail.com       33
1  Cynthia   Kituku    Ckituku@gmail.com       26
2   Eugene   Kituku    Ekituku@gmail.com       18
3    Chris  Schafer                 None       50
5     None      NaN  anonymous@email.com     None
6       NA  Missing                   NA  Missing